#include <uapi/linux/if_ether.h>
#include <uapi/linux/if_packet.h>
#include <uapi/linux/ip.h>
#include <uapi/linux/in.h>
#include <uapi/linux/string.h>
#include <uapi/linux/tcp.h>
#include <uapi/linux/types.h>
#include <uapi/linux/ipv6.h>
#include <uapi/linux/udp.h>

enum package_phase {
    P_UNKNOWN = 0,
	P_REQUEST = 1,
	P_RESPONSE = 2,
};

typedef enum {
    PAYLOAD_UNDETERMINED,
    PAYLOAD_GRPC,
    PAYLOAD_NOT_GRPC,
    PAYLOAD_DUBBO,
    PAYLOAD_MYSQL,
    PAYLOAD_REDIS,
} rpc_status_t;

enum dubbo_phase {
    D_REQUEST = 1,
    D_RESPONSE = 0,
};

typedef enum {
    NOT_DUBBO_EVENT = 0,
    IS_DUBBO_EVENT = 1, // Identifies whether it is an event message, for example, a heartbeat event. Set to 1 if this is an event.
} dubbo_event_t;

enum eth_ip_type {
    ETH_TYPE_IPV4 = 0,
    ETH_TYPE_IPV6 = 1,
};

#define MYSQL_ERROR_MESSAGE_MAX_SIZE 10

struct rpc_package_t {
    __u32 rpc_type; // 4
	__u32 phase; // 8
	__u32 ip_type; // 12
	__u32 dstIP; // 16
    __u32 dstPort; // 20
    __u32 srcIP; // 24
	__u32 srcPort; // 28
	__u32 seq; // 32
	//packge的产生时间
	__u32 duration; // 36
	__u32 pid; // 40
	__u8 path_len; // 41
	char path[MAX_HTTP2_PATH_CONTENT_LENGTH]; // 141
	char status[MAX_HTTP2_STATUS_HEADER_LENGTH]; // 142
	__u8 dubbo_status; // 143
	__u16 mysql_status; // 145
	char mysql_msg[MYSQL_ERROR_MESSAGE_MAX_SIZE];
};

#define IP_MF	  0x2000
#define IP_OFFSET 0x1FFF

#define HTTP2_FRAME_HEADER_SIZE 9
#define HTTP2_SETTINGS_SIZE 6

#define HTTP2_MARKER_SIZE 24
#define CLASSIFICATION_MAX_BUFFER (HTTP2_MARKER_SIZE)
#define BLK_SIZE (16)

#define STRINGIFY(a) #a

// mysql
// Each MySQL command starts with mysql_hdr, thus the minimum length is sizeof(mysql_hdr).
#define MYSQL_MIN_LENGTH 5

// Taken from https://dev.mysql.com/doc/dev/mysql-server/latest/page_protocol_com_query.html
#define MYSQL_COMMAND_QUERY 0x3
// Taken from https://dev.mysql.com/doc/dev/mysql-server/latest/page_protocol_com_stmt_prepare.html
#define MYSQL_PREPARE_QUERY 0x16
// Taken from https://dev.mysql.com/doc/dev/mysql-server/latest/page_protocol_connection_phase_packets_protocol_handshake_v10.html.
#define MYSQL_SERVER_GREETING_V10 0xa
